INSERT INTO plan(
    uuid,
    id,
    contract_subject,
    commission_kind_id,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    sum_excluded_vat_rub,
    currency_id,
    currency_rate,
    purchasing_type_id,
    status_id,
    delivery_start_date,
    delivery_end_date,
    pricing_organization_unit_id,
    section_id,
    created_by,
    changed_by,
    created_at,
    changed_at) values
        ('00000000-0000-0000-0000-000000000001',1,'Слишком много комаров',1,2,3,4,5,6,10,2,356,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000002',2,'Слишком много комаров',1,2,3,4,5,6,10,2,356,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000003',3,'Слишком много комаров',1,2,3,4,5,6,10,2,356,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000004',4,'Трубы должны блестеть',1,2,3,4,5,6,10,2,356,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000005',5,'Трубы должны блестеть',1,2,3,4,5,6,10,2,356,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000006',6,'Трубы должны блестеть',1,2,3,4,5,6,10,2,221,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000007',7,'Трубы должны блестеть',1,2,3,4,5,6,10,2,221,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp);

INSERT INTO status_history(
    uuid,
    object_uuid,
    status_id,
    comment,
    created_by,
    created_at
) values
    ('90000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000001',351,'no commento', 99, now()),
    ('90000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000002',352,'no commento', 99, now()),
    ('90000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000003',353,'no commento', 99, now()),
    ('90000000-0000-0000-0000-000000000004','00000000-0000-0000-0000-000000000004',353,'no commento', 99, now()),
    ('90000000-0000-0000-0000-000000000006','00000000-0000-0000-0000-000000000006',351,'no commento', 99, now()),
    ('90000000-0000-0000-0000-000000000007','00000000-0000-0000-0000-000000000007',351,'no commento', 99, now());
