use ahash::AHashMap;
use async_trait::async_trait;
use sqlx::PgPool;

use asez2_shared_db::db_item::AsezTimestamp;
use shared_essential::{
    domain::okpd2::Okpd2,
    presentation::dto::{
        master_data::{error::MasterDataResult, request::SearchByUserInput},
        response_request::Messages,
    },
};

use crate::application::{
    hierarchical_values::{Hierarchy, HierarchyData, HierarchyGenerator},
    master_data::base::contains_case_insensitive,
};
use crate::domain::MasterDataDirectoryInterface;

use super::MasterDataCommonDirectory;

fn is_okpd2_code_prefix(s: &str) -> bool {
    let mut digit_count = 0;
    let mut segment_count = 0;

    let segment_ok = |digit_count, segment_count, allow_empty| {
        // первый сегмент всегда состоит из двух цифр
        if segment_count == 0 {
            digit_count == 2
        } else {
            segment_count < 4
                && (allow_empty || digit_count > 0)
                && digit_count <= 3
        }
    };

    for ch in s.chars() {
        match ch {
            '0'..='9' => {
                digit_count += 1;
            }
            '.' if segment_ok(digit_count, segment_count, false) => {
                digit_count = 0;
                segment_count += 1;
            }
            _ => {
                return false;
            }
        }
    }
    // разрешаем последний пустой сегмент
    segment_ok(digit_count, segment_count, true)
}

#[cfg(test)]
mod tests {
    #[test]
    fn okpd2_code_prefix() {
        for s in &["01.02.123.321"] {
            for l in 2..s.len() {
                let s = &s[..l];
                assert!(super::is_okpd2_code_prefix(s), "{s}");
            }
        }
    }

    #[test]
    fn not_okpd2_code_prefix() {
        for s in &["0", "123", ".", "01..", "01.12435", "01.1.1.1.1"] {
            assert!(!super::is_okpd2_code_prefix(s), "{s}");
        }
    }
}
#[derive(Debug, Default)]
pub struct Okpd2Directory(pub(crate) MasterDataCommonDirectory<Okpd2>);

#[async_trait]
impl MasterDataDirectoryInterface<Okpd2> for Okpd2Directory {
    async fn load(&mut self, pool: &PgPool) -> MasterDataResult<()> {
        self.0.load(pool).await
    }

    async fn get_by_ids(
        &self,
        ids: &[i32],
    ) -> MasterDataResult<(Messages, Vec<Okpd2>)> {
        self.0.get_by_ids(ids).await
    }

    async fn get_by_id(&self, id: &i32) -> MasterDataResult<Okpd2> {
        self.0.get_by_id(id).await
    }

    async fn search(
        &self,
        search_request: &SearchByUserInput,
    ) -> MasterDataResult<(Messages, Vec<Okpd2>)> {
        let SearchByUserInput {
            from,
            search,
            quantity,
        } = search_request;
        let map = self.0.data.read().await;
        let records = map.values();
        let result = if is_okpd2_code_prefix(search) {
            records
                .filter(|record| record.code.starts_with(search))
                .skip(*from as usize)
                .take(*quantity as usize)
                .cloned()
                .collect()
        } else {
            let search = search_request.search.trim().to_lowercase();
            records
                .filter(|record| contains_case_insensitive(&record.text, &search))
                .skip(*from as usize)
                .take(*quantity as usize)
                .cloned()
                .collect()
        };
        Ok((Messages::default(), result))
    }

    async fn get_updates(
        &self,
        timestamp: AsezTimestamp,
    ) -> MasterDataResult<Vec<Okpd2>> {
        self.0.get_updates(timestamp).await
    }

    async fn get_full_data(&self) -> MasterDataResult<Vec<Okpd2>> {
        self.0.get_full_data().await
    }
}

#[async_trait]
impl HierarchyGenerator for Okpd2Directory {
    async fn generate(&self) -> MasterDataResult<(&'static str, Hierarchy)> {
        let items = self.get_full_data().await?;
        Ok(("okpd2", okpd2_generate_hierarchy(items).into()))
    }
}

/// Геренация иерархии идентификаторов кодов ОКПД2 на основе строковых кодов.
///
/// ```ignore
/// (2,'01','Продукция и услуги сельского хозяйства и охоты'),
/// (3,'01.1','Культуры однолетние'),
/// (4,'01.11','Культуры зерновые (кроме риса), зернобобовые, семена масличных культур'),
/// (5,'01.11.1','Пшеница'),
/// (6,'01.11.11','Пшеница твердая'),
/// (7,'01.11.11.110','Пшеница озимая твердая'),
/// (8,'01.11.11.111','Зерно озимой твердой пшеницы'),
/// (9,'01.11.11.112','Семена озимой твердой пшеницы'),
/// (10,'01.11.11.120','Пшеница яровая твердая'),
/// (11,'01.11.11.121','Зерно яровой твердой пшеницы'),
/// (12,'01.11.11.122','Семена яровой твердой пшеницы'),
/// (13,'01.11.11.130','Зерноотходы твердой пшеницы'),
/// (14,'01.11.12','Пшеница, кроме твердой пшеницы'),
/// ...
/// ```
fn okpd2_generate_hierarchy(mut items: Vec<Okpd2>) -> AHashMap<i32, HierarchyData> {
    // 1) сортируем по коду, таким образом все дети находятся после родителей
    items.sort_by(|a, b| a.code.cmp(&b.code));

    let mut stack: Vec<(String, i32)> = Vec::new(); // (code, id)
    let mut hierarchy = AHashMap::with_capacity(items.len());

    for Okpd2 {
        id,
        code,
        is_removed,
        from_date,
        to_date,
        ..
    } in items
    {
        // 2) Откатываемся, пока верхушка стека не является родителем.
        while let Some((parent_code, _)) = stack.last() {
            if is_parent(parent_code, &code) {
                break;
            }
            stack.pop();
        }

        // 3) Собираем id родителей (корень … текущий уровень-1).
        let parents: Vec<i32> = stack.iter().map(|&(_, pid)| pid).collect();
        hierarchy.insert(
            id,
            HierarchyData {
                parents,
                code: code.clone(),
                is_removed,
                from_date,
                to_date,
            },
        );

        // 4) Текущий узел может стать родителем следующих.
        stack.push((code, id));
    }

    hierarchy
}

/// Возвращает `true`, если `parent` является родителем `child`.
///
/// Применяется в алгоритме [построения иерархии кодов ОКПД2](okpd2_generate_hierarchy),
/// работает только в случае `parent` < `child`.
fn is_parent(parent: &str, child: &str) -> bool {
    debug_assert!(
        parent < child,
        "предикат работает только на кодах, сортированных по возрастанию"
    );

    // Случай 1: ребёнок длиннее и начинается со строки-родителя.
    // parent: 01.02.03
    // child:  01.02.03.40
    if child.len() > parent.len() && child.starts_with(parent) {
        return true;
    }
    // Случай 2: одинаковая длина, но у родителя в конце больше 0.
    // Бывает только для категорий, т.е. заполнены все позиции.
    //
    // parent: 01.02.03.100
    // child:  01.02.03.140
    //
    // parent: 01.02.03.140
    // child:  01.02.03.141
    const MAX_LEN: usize = "XX.XX.XX.XXX".len();
    if parent.len() == child.len()
        && parent.len() == MAX_LEN
        && parent.ends_with('0')
    {
        let child = child.trim_end_matches('0');
        let parent = parent.trim_end_matches('0');
        return child.len() > parent.len();
    }
    false
}

#[cfg(test)]
mod okpd2_hierarchy {
    use ahash::AHashMap;
    use itertools::Itertools;
    use shared_essential::domain::okpd2::Okpd2;

    use super::*;
    use crate::application::hierarchical_values::HierarchyData;

    #[test]
    fn is_parent() {
        for (parent, child) in [
            ("01", "01.1"),
            ("01", "01.11"),
            ("01.1", "01.11"),
            ("01.11.11.110", "01.11.11.111"),
        ] {
            assert!(
                super::is_parent(parent, child),
                "{parent} should be a parent of {child}"
            );
        }
    }

    #[test]
    fn is_not_parent() {
        for (parent, child) in [
            ("01", "02"),
            ("01", "03.11"),
            ("01.1", "01.21"),
            ("01.11.11", "201.11.11.000"),
            ("01.11.11.210", "201.11.11.300"),
        ] {
            assert!(
                !super::is_parent(parent, child),
                "{parent} shoul not be a parent of {child}"
            );
        }
    }

    /// Простейший случай.
    const CODES_STRAIGHT: &[(i32, &str, &[i32])] = &[
        (2, "01", &[]),
        (3, "01.1", &[2]),
        (4, "01.11", &[2, 3]),
        (5, "01.11.1", &[2, 3, 4]),
        (6, "01.11.11", &[2, 3, 4, 5]),
        (7, "01.11.11.110", &[2, 3, 4, 5, 6]),
        (8, "01.11.11.111", &[2, 3, 4, 5, 6, 7]),
        (9, "01.11.11.112", &[2, 3, 4, 5, 6, 7]),
        (10, "01.11.11.120", &[2, 3, 4, 5, 6]),
        (11, "01.11.11.121", &[2, 3, 4, 5, 6, 10]),
        (12, "01.11.11.122", &[2, 3, 4, 5, 6, 10]),
        (13, "01.11.11.130", &[2, 3, 4, 5, 6]),
        (14, "01.11.12", &[2, 3, 4, 5]),
        (15, "01.11.12.110", &[2, 3, 4, 5, 14]),
        (16, "01.11.12.111", &[2, 3, 4, 5, 14, 15]),
        (17, "01.11.12.112", &[2, 3, 4, 5, 14, 15]),
    ];

    /// Аномалии с категорией `96.09.11.000` или вообще без категории, `96.09.19` -> `96.09.19.111`.
    const CODES_SKIP_CATEGORY: &[(i32, &str, &[i32])] = &[
        (64618, "96", &[]),
        (64775, "96.09", &[64618]),
        (64776, "96.09.1", &[64618, 64775]),
        (64777, "96.09.11", &[64618, 64775, 64776]),
        (64778, "96.09.11.000", &[64618, 64775, 64776, 64777]),
        (64779, "96.09.12", &[64618, 64775, 64776]),
        (64780, "96.09.12.000", &[64618, 64775, 64776, 64779]),
        (64781, "96.09.13", &[64618, 64775, 64776]),
        (64782, "96.09.13.000", &[64618, 64775, 64776, 64781]),
        (64783, "96.09.19", &[64618, 64775, 64776]),
        (64784, "96.09.19.111", &[64618, 64775, 64776, 64783]),
        (64785, "96.09.19.112", &[64618, 64775, 64776, 64783]),
        (64786, "96.09.19.113", &[64618, 64775, 64776, 64783]),
        (64787, "96.09.19.114", &[64618, 64775, 64776, 64783]),
        (64788, "96.09.19.115", &[64618, 64775, 64776, 64783]),
        (64789, "96.09.19.116", &[64618, 64775, 64776, 64783]),
        (64790, "96.09.19.117", &[64618, 64775, 64776, 64783]),
        (64791, "96.09.19.118", &[64618, 64775, 64776, 64783]),
        (64792, "96.09.19.119", &[64618, 64775, 64776, 64783]),
        (64793, "96.09.19.121", &[64618, 64775, 64776, 64783]),
        (64794, "96.09.19.122", &[64618, 64775, 64776, 64783]),
        (64795, "96.09.19.123", &[64618, 64775, 64776, 64783]),
        (64796, "96.09.19.124", &[64618, 64775, 64776, 64783]),
        (64797, "96.09.19.125", &[64618, 64775, 64776, 64783]),
        (64798, "96.09.19.126", &[64618, 64775, 64776, 64783]),
        (64799, "96.09.19.127", &[64618, 64775, 64776, 64783]),
        (64800, "96.09.19.128", &[64618, 64775, 64776, 64783]),
        (64801, "96.09.19.129", &[64618, 64775, 64776, 64783]),
        (64802, "96.09.19.131", &[64618, 64775, 64776, 64783]),
        (64803, "96.09.19.139", &[64618, 64775, 64776, 64783]),
    ];

    /// Дополнительный уровень категорий, `10.51.40.100` -> `10.51.40.110`.
    const CODES_SKIP_DOUBLE_CATEGORY: &[(i32, &str, &[i32])] = &[
        (4697, "10", &[]),
        (5609, "10.5", &[4697]),
        (5610, "10.51", &[4697, 5609]),
        (5683, "10.51.4", &[4697, 5609, 5610]),
        (5684, "10.51.40", &[4697, 5609, 5610, 5683]),
        (5685, "10.51.40.100", &[4697, 5609, 5610, 5683, 5684]),
        (5686, "10.51.40.110", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5687, "10.51.40.111", &[4697, 5609, 5610, 5683, 5684, 5685, 5686]),
        (5688, "10.51.40.112", &[4697, 5609, 5610, 5683, 5684, 5685, 5686]),
        (5692, "10.51.40.120", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5693, "10.51.40.121", &[4697, 5609, 5610, 5683, 5684, 5685, 5692]),
        (5694, "10.51.40.122", &[4697, 5609, 5610, 5683, 5684, 5685, 5692]),
        (5695, "10.51.40.130", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5696, "10.51.40.131", &[4697, 5609, 5610, 5683, 5684, 5685, 5695]),
        (5697, "10.51.40.132", &[4697, 5609, 5610, 5683, 5684, 5685, 5695]),
        (5698, "10.51.40.140", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5699, "10.51.40.141", &[4697, 5609, 5610, 5683, 5684, 5685, 5698]),
        (5700, "10.51.40.142", &[4697, 5609, 5610, 5683, 5684, 5685, 5698]),
        (5701, "10.51.40.150", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5702, "10.51.40.151", &[4697, 5609, 5610, 5683, 5684, 5685, 5701]),
        (5703, "10.51.40.152", &[4697, 5609, 5610, 5683, 5684, 5685, 5701]),
        (5704, "10.51.40.160", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5705, "10.51.40.161", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5706, "10.51.40.162", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5707, "10.51.40.163", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5708, "10.51.40.164", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5709, "10.51.40.165", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5710, "10.51.40.166", &[4697, 5609, 5610, 5683, 5684, 5685, 5704]),
        (5711, "10.51.40.170", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5712, "10.51.40.171", &[4697, 5609, 5610, 5683, 5684, 5685, 5711]),
        (5713, "10.51.40.172", &[4697, 5609, 5610, 5683, 5684, 5685, 5711]),
        (5714, "10.51.40.173", &[4697, 5609, 5610, 5683, 5684, 5685, 5711]),
        (5715, "10.51.40.174", &[4697, 5609, 5610, 5683, 5684, 5685, 5711]),
        (5716, "10.51.40.179", &[4697, 5609, 5610, 5683, 5684, 5685, 5711]),
        (5717, "10.51.40.180", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5718, "10.51.40.190", &[4697, 5609, 5610, 5683, 5684, 5685]),
        (5719, "10.51.40.191", &[4697, 5609, 5610, 5683, 5684, 5685, 5718]),
        (5720, "10.51.40.192", &[4697, 5609, 5610, 5683, 5684, 5685, 5718]),
        (5721, "10.51.40.199", &[4697, 5609, 5610, 5683, 5684, 5685, 5718]),
    ];

    /// Много кодов в подкатегории, так что у `10.41.29.153` категория `10.41.29.110`, а не `10.41.29.150`.
    const CODES_LONG_SUB_CATEGORY: &[(i32, &str, &[i32])] = &[
        (4697, "10", &[]),
        (5385, "10.41", &[4697]),
        (5394, "10.41.2", &[4697, 5385]),
        (5413, "10.41.29", &[4697, 5385, 5394]),
        (5414, "10.41.29.110", &[4697, 5385, 5394, 5413]),
        (5415, "10.41.29.111", &[4697, 5385, 5394, 5413, 5414]),
        (5416, "10.41.29.112", &[4697, 5385, 5394, 5413, 5414]),
        (5417, "10.41.29.113", &[4697, 5385, 5394, 5413, 5414]),
        (5418, "10.41.29.114", &[4697, 5385, 5394, 5413, 5414]),
        (5419, "10.41.29.115", &[4697, 5385, 5394, 5413, 5414]),
        (5420, "10.41.29.116", &[4697, 5385, 5394, 5413, 5414]),
        (5421, "10.41.29.117", &[4697, 5385, 5394, 5413, 5414]),
        (5422, "10.41.29.118", &[4697, 5385, 5394, 5413, 5414]),
        (5423, "10.41.29.119", &[4697, 5385, 5394, 5413, 5414]),
        (5424, "10.41.29.121", &[4697, 5385, 5394, 5413, 5414]),
        (5425, "10.41.29.122", &[4697, 5385, 5394, 5413, 5414]),
        (5426, "10.41.29.123", &[4697, 5385, 5394, 5413, 5414]),
        (5427, "10.41.29.124", &[4697, 5385, 5394, 5413, 5414]),
        (5428, "10.41.29.125", &[4697, 5385, 5394, 5413, 5414]),
        (5429, "10.41.29.126", &[4697, 5385, 5394, 5413, 5414]),
        (5430, "10.41.29.127", &[4697, 5385, 5394, 5413, 5414]),
        (5431, "10.41.29.128", &[4697, 5385, 5394, 5413, 5414]),
        (5432, "10.41.29.129", &[4697, 5385, 5394, 5413, 5414]),
        (5433, "10.41.29.131", &[4697, 5385, 5394, 5413, 5414]),
        (5434, "10.41.29.132", &[4697, 5385, 5394, 5413, 5414]),
        (5435, "10.41.29.133", &[4697, 5385, 5394, 5413, 5414]),
        (5436, "10.41.29.134", &[4697, 5385, 5394, 5413, 5414]),
        (5437, "10.41.29.135", &[4697, 5385, 5394, 5413, 5414]),
        (5438, "10.41.29.136", &[4697, 5385, 5394, 5413, 5414]),
        (5439, "10.41.29.137", &[4697, 5385, 5394, 5413, 5414]),
        (5440, "10.41.29.138", &[4697, 5385, 5394, 5413, 5414]),
        (5441, "10.41.29.139", &[4697, 5385, 5394, 5413, 5414]),
        (5442, "10.41.29.141", &[4697, 5385, 5394, 5413, 5414]),
        (5443, "10.41.29.142", &[4697, 5385, 5394, 5413, 5414]),
        (5444, "10.41.29.143", &[4697, 5385, 5394, 5413, 5414]),
        (5445, "10.41.29.144", &[4697, 5385, 5394, 5413, 5414]),
        (5446, "10.41.29.145", &[4697, 5385, 5394, 5413, 5414]),
        (5447, "10.41.29.146", &[4697, 5385, 5394, 5413, 5414]),
        (5448, "10.41.29.147", &[4697, 5385, 5394, 5413, 5414]),
        (5449, "10.41.29.148", &[4697, 5385, 5394, 5413, 5414]),
        (5450, "10.41.29.149", &[4697, 5385, 5394, 5413, 5414]),
        (5451, "10.41.29.151", &[4697, 5385, 5394, 5413, 5414]),
        (5452, "10.41.29.152", &[4697, 5385, 5394, 5413, 5414]),
        (5453, "10.41.29.153", &[4697, 5385, 5394, 5413, 5414]),
    ];

    #[test]
    fn build_hierarchy() {
        for chunk in [
            CODES_STRAIGHT,
            CODES_SKIP_CATEGORY,
            CODES_SKIP_DOUBLE_CATEGORY,
            CODES_LONG_SUB_CATEGORY,
        ] {
            let (items, mut expected): (Vec<_>, AHashMap<_, _>) = chunk
                .iter()
                .map(|(id, code, exp)| {
                    (
                        Okpd2 {
                            id: *id,
                            code: code.to_string(),
                            ..Default::default()
                        },
                        (id, exp.to_vec()),
                    )
                })
                .unzip();
            let map = okpd2_generate_hierarchy(items);

            for (k, HierarchyData { parents: v, .. }) in
                map.into_iter().sorted_by_key(|(k, _)| *k)
            {
                let exp = expected.remove(&k);
                assert!(exp.is_some());
                assert_eq!(v, exp.unwrap(), "code id {k}");
            }
        }
    }
}
