INSERT INTO plan(
    uuid,
    id,
    contract_subject,
    commission_kind_id,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    sum_excluded_vat_rub,
    currency_id,
    currency_rate,
    purchasing_type_id,
    status_id,
    delivery_start_date,
    delivery_end_date,
    pricing_organization_unit_id,
    section_id,
    created_by,
    changed_by,
    created_at,
    changed_at) values
        ('00000000-0000-0000-0000-000000000001','1','Слишком много комаров',1,2,3,4,5,6,10,2,251,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000002','2','Слишком много комаров',1,2,3,4,5,6,10,2,0,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000003','3','Слишком много комаров',1,2,3,4,5,6,10,2,223,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000004','4','Трубы должны блестеть',1,2,3,4,5,6,10,2,225,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000005','5','Трубы должны блестеть',1,2,3,4,5,6,10,2,251,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000006','6','Трубы должны блестеть',1,2,3,4,5,6,10,7,251,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000007','7','Трубы должны блестеть',1,2,3,4,5,6,10,2,251,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000008','8','Трубы должны блестеть',1,2,3,4,5,6,10,2,251,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000009','9','Трубы должны блестеть',1,2,3,4,5,6,10,2,223,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp),
        ('00000000-0000-0000-0000-000000000010','10','Трубы должны блестеть',1,2,3,4,5,6,10,7,225,'1901-01-01','1901-01-01',1,1,99,99,now()::timestamp,now()::timestamp);

INSERT INTO contract_amendment(
    uuid,
    id,
    status_id,
    contract_subject,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    currency_id,
    pricing_expert_id, 
    pricing_resume,
    section_id,
    created_at,
    changed_at,
    created_by,
    changed_by,
    commission_kind_id,
    purchasing_type_id) values
        ('00000000-0000-0000-0001-000000000000',101,251,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1),
        ('00000000-0000-0000-0002-000000000000',102,251,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1),
        ('00000000-0000-0000-0003-000000000000',103,251,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1),
        ('00000000-0000-0000-0004-000000000000',104,353,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1),
        ('00000000-0000-0000-0005-000000000000',105,252,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1),
        ('00000000-0000-0000-0006-000000000000',106,253,'Subject', 1, 1, 1, 1, 1, 'Resume', 1, now()::timestamp,now()::timestamp,99,99, 1, 1);

-- This is used to test the status reversion code. Some of the records are dud to test whether we select the right ones.
INSERT INTO status_history(
    uuid,
    object_uuid,
    status_id,
    comment,
    created_at,
    created_by
) values 
    ('10000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000001',223,'something something',now()::timestamp,1),
    ('20000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000007',343,'something something',now()::timestamp,1),
    ('30000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000008',223,'something something',now()::timestamp,1),
    ('40000000-0000-0000-0000-000000000001','00000000-0000-0000-0003-000000000000',353,'something something',now()::timestamp,1),
    ('50000000-0000-0000-0000-000000000001','00000000-0000-0000-0006-000000000000',343,'something something','1901-01-01 00:00:00',1),
    ('60000000-0000-0000-0000-000000000001','00000000-0000-0000-0004-000000000000',341,'something something','1901-01-01 00:00:00',1),
    ('70000000-0000-0000-0000-000000000001','00000000-0000-0000-0002-000000000000',131,'something something','1901-01-01 00:00:00',1),
    ('80000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000001',222,'something something','1901-01-01 00:00:01',1),
    ('90000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000001',221,'something something','1901-01-01 00:00:00',1),
    ('01000000-0000-0000-0000-000000000001','00000000-0000-0000-0000-000000000001',251,'something something','1901-01-01 00:00:02',1);


INSERT INTO public.plan_item(
    uuid,plan_uuid,category_id,description_internal,quantity,
    id,product_type_id,budget_item_id,okved2_id,unit_id,payment_balance_item_id,is_not_russian_delivery,created_by,changed_by,currency_id,currency_rate,
    created_at, changed_at
    )
    VALUES 
    ('00000000-0000-0000-0000-000000000001', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,0,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000002', '00000000-0000-0000-0000-000000000001',9000,'труба, железная,',9000,1,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000003', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,2,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000004', '00000000-0000-0000-0000-000000000001',11000,'труба, железная,',11000,3,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000005', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,4,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000006', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,5,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000007', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,6,6,2,3,4,5,false,99,99,2,10,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000008', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,7,7,2,3,4,5,false,99,99,2,10,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000009', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,8,8,2,3,4,5,false,99,99,2,10,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000010', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,9,9,2,3,4,5,false,99,99,3,9,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000011', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,10,10,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000012', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,11,11,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000013', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,12,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000014', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,13,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000015', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,14,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000016', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,15,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date),
    ('00000000-0000-0000-0000-000000000017', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,16,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date);

ALTER TABLE plan_item_version DROP COLUMN pricing_version;
ALTER TABLE plan_item_version ADD COLUMN pricing_version SMALLINT NOT NULL;
INSERT INTO plan_item_version (SELECT *,1 FROM plan_item);
