INSERT INTO plan(
    uuid,
    id,
    contract_subject,
    commission_kind_id,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    sum_excluded_vat_rub,
    currency_id,
    currency_rate,
    purchasing_type_id,
    status_id,
    delivery_start_date,
    delivery_end_date,
    created_by,
    changed_by,
    pricing_organization_unit_id,
    created_at,
    changed_at,
    pricing_sum_excluded_vat) values
        ('00000000-0000-0000-0000-000000000001',1,'Слишком много комаров',1,2,3,4,5,6,10,7,252,now()::date,now()::date,99,99,1,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000002',2,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000003',3,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        
        ('00000000-0000-0000-0000-000000000004',4,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000005',5,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000006',6,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000007',7,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000008',8,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-000000000009',9,'Слишком много комаров',1,2,3,4,5,6,10,7,251,now()::date,now()::date,99,99,2,now()::date,now()::date, 1),
        ('00000000-0000-0000-0000-100001234500',10,'План с несколькими повестками',1,2,3,4,5,6,10,7,252,now()::date,now()::date,99,99,2,now()::date,now()::date, 1);


INSERT INTO contract_amendment(
    uuid,
    id,
    contract_subject,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    currency_id,
    status_id,
    created_by,
    changed_by,
    created_at,
    changed_at,
    pricing_expert_id,
    pricing_organization_unit_id,
    pricing_resume,
    section_id,
    commission_kind_id,
    purchasing_type_id,
    pricing_sum_excluded_vat) values
        ('00000000-0000-0000-0000-000000000011',11,'InPerson registered',2,3,4,6,252,99,99,now()::date,now()::date, 1, 2, 'Resume', 1, 1, 1, 1),
        ('00000000-0000-0000-0000-000000000012',12,'InPerson registered',2,3,4,6,251,99,99,now()::date,now()::date, 1, 1, 'Resume', 1, 1, 1, 1),
        ('00000000-0000-0000-0000-000000000013',13,'InPerson registered',2,3,4,6,251,99,99,now()::date,now()::date, 1, 1, 'Resume', 1, 1, 1, 1),
        ('00000000-0000-0000-0000-000000000014',14,'InPerson registered',2,3,4,6,251,99,99,now()::date,now()::date, 1, 1, 'Resume', 1, 1, 1, 1);

INSERT INTO agenda(
    uuid,
    id,
    meeting_date,
    status_id,
    pricing_organization_unit_id,
    is_removed,
    created_at,
    changed_at,
    created_by,
    changed_by) values
        ('11111111-2222-3333-4444-000000000001',123,'2023-01-01',100,2,false,'2023-01-01','2023-01-01',99,99),
        -- Самая новая повестка для плана - `00000000-0000-0000-0000-000000000001`
        ('11111111-2222-3333-4444-000000000002',123,'2025-02-03',100,2,false,'2025-02-03','2025-02-03',99,99),
        ('11111111-2222-3333-4444-000000000003',123,'2024-04-05',100,2,false,'2024-04-05','2024-04-05',99,99),

        ('00000000-0000-0000-0000-000000000001',1,'1900-01-01',100,2,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000002',2,'1900-01-02',100,2,false,'2000-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000003',3,'1900-01-03',100,2,false,'2100-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000006',3,'1900-01-03',100,2,false,'2100-01-01','1900-01-01',99,99),
        
        -- Удаленные повестки для плана `00000000-0000-0000-0000-000000000009`
        ('00000000-0000-0000-0000-000000000004',4,'1900-01-03',100,2,true,'2100-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000005',5,'1900-01-03',100,2,true,'2100-01-01','1900-01-01',99,99),

        -- Три повестки для плана `00000000-0000-0000-0000-100001234500`
        -- Agenda 1
        ('11111111-0000-0000-0000-000000000001',1,'2023-01-01',100,2,false,'2023-01-01','2023-01-01',99,99),
        -- Agenda 2
        ('22222222-0000-0000-0000-000000000002',2,'2023-01-02',100,2,false,'2023-01-02','2023-01-02',99,99),
        -- Agenda 3 - удаленная
        ('33333333-0000-0000-0000-000000000003',3,'2023-01-03',100,2,true,'2023-01-03','2023-01-03',99,99);

INSERT INTO agenda_item(
    uuid,
    agenda_uuid,
    source_uuid,
    number,
    is_registered_by_d647,
    is_removed,
    is_excluded,
    created_at,
    changed_at,
    created_by,
    changed_by) values
        ('00000000-0000-1000-0000-000000000001','11111111-2222-3333-4444-000000000001','00000000-0000-0000-0000-000000000001','1',false,false,false,'1900-01-02','1900-01-02',99,99),
        ('00000000-0000-2000-0000-000000000001','11111111-2222-3333-4444-000000000002','00000000-0000-0000-0000-000000000001','1',false,false,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-3000-0000-000000000001','11111111-2222-3333-4444-000000000003','00000000-0000-0000-0000-000000000001','1',false,false,false,'1900-01-03','1900-01-03',99,99),

        ('00000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000011','1',false,false,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000002','1',false,false,false,'1900-01-01','1900-01-01',99,99),

        -- Удаленный элемент повестки
        ('00000000-1000-0000-0000-000000000004','00000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000003','1',false,true,false,'1900-01-01','1900-01-01',99,99),
        -- Исключенный элемент повестки
        ('00000000-2000-0000-0000-000000000004','00000000-0000-0000-0000-000000000002','00000000-0000-0000-0000-000000000003','1',false,false,true,'1900-01-01','1900-01-01',99,99),
        
        ('00000000-0000-0000-0000-000000000005','00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000004',1,false,false,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000006','00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000005',2,false,true,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000007','00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000014',3,false,true,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000008','00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000006',4,true,false,false,'1900-01-01','1900-01-01',99,99),
        ('00000000-0000-0000-0000-000000000009','00000000-0000-0000-0000-000000000003','00000000-0000-0000-0000-000000000013',5,true,true,false,'1900-01-01','1900-01-01',99,99),
        
        ('00000000-0000-0000-0000-000000000010','00000000-0000-0000-0000-000000000004','00000000-0000-0000-0000-000000000009',5,false,false,false,'1900-01-01','1900-01-01',99,99),
        
        -- В Agenda удаленная повестка
        ('00000000-0000-0000-0000-000000000011','00000000-0000-0000-0000-000000000005','00000000-0000-0000-0000-000000000009',5,false,false,false,'1900-01-01','1900-01-01',99,99),

        -- is_removed = true
        ('12345678-0000-0000-0000-000000000010','11111111-0000-0000-0000-000000000001','00000000-0000-0000-0000-100001234500',1,false,true,false,'1900-01-01','1900-01-01',99,99),  
        -- Должна выбраться эта строка повестки для плана `00000000-0000-0000-0000-100001234500`
        ('90101112-0000-0000-0000-000000000011','22222222-0000-0000-0000-000000000002','00000000-0000-0000-0000-100001234500',1,false,false,false,'1900-01-01','1900-01-01',99,99),
        -- is_removed = true        
        ('13141510-0000-0000-0000-000000000012','33333333-0000-0000-0000-000000000003','00000000-0000-0000-0000-100001234500',1,false,true,false,'1900-01-01','1900-01-01',99,99),
        
        
        ('90101112-1111-0000-0000-000000000011','00000000-0000-0000-0000-000000000006','00000000-0000-0000-0000-000000000002',1,false,false,false,'1900-01-01','1900-01-01',99,99),
        ('90101112-2222-0000-0000-000000000011','00000000-0000-0000-0000-000000000006','00000000-0000-0000-0000-000000000002',1,false,false,false,'1900-01-01','1900-01-01',99,99),
        ('90101112-3333-0000-0000-000000000011','00000000-0000-0000-0000-000000000006','00000000-0000-0000-0000-000000000002',1,false,false,false,'2029-01-01','2029-02-02',99,99);  
        ;

-- Version updates fail if there are no versions, so we create them manually.
ALTER TABLE plan_version DROP COLUMN pricing_version;
ALTER TABLE plan_version ADD COLUMN pricing_version SMALLINT NOT NULL;
INSERT INTO plan_version (SELECT *,1 FROM plan);
INSERT INTO contract_amendment_version(
    uuid,
    id,
    commission_kind_id,
    purchasing_type_id,
    status_id,
    year,
    is_check_documentation,
    pricing_expert_id,
    contract_subject,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    currency_id,  
    pricing_resume,
    section_id,
    created_at,
    changed_at,
    created_by,
    changed_by,
    pricing_version
) (SELECT 
    uuid,
    id,
    commission_kind_id,
    purchasing_type_id,
    status_id,
    year,
    is_check_documentation,
    pricing_expert_id,
    contract_subject,
    customer_id,
    supplier_id,
    sum_excluded_vat,
    currency_id,  
    pricing_resume,
    section_id,
    created_at,
    changed_at,
    created_by,
    changed_by,1 FROM contract_amendment);
