INSERT INTO public.plan(
  uuid, status_id, commission_kind_id, purchasing_type_id, id, customer_id, contract_subject, sum_excluded_vat_rub,
  supplier_id,sum_excluded_vat,currency_id, delivery_start_date, delivery_end_date,created_by,changed_by, 
  is_check_documentation, year, executor_method_id, pricing_expert_id, currency_rate, created_at, changed_at, pricing_sum_excluded_vat
  )
VALUES
  ('00000000-0000-0000-0000-000000000001', 221, 1, 2, 1, 10, 'Разработка электропривода трубопроводной арматуры', 1504200,0,0,1,now()::date,now()::date,99,99,false,2024, 1, 999001,100,now()::date,now()::date, 1),
  ('00000000-0000-0000-0000-000000000002', 253, 1, 2, 2, 42, 'Разработка электропривода трубопроводной арматуры нормально-закрытого типа',10256087,0,0,1,now()::date,now()::date,99,99,false,2024, 1,999001,10,now()::date,now()::date, 1);


INSERT INTO public.plan_item(
    uuid,plan_uuid,category_id,description_internal,quantity,
    id,number,product_type_id,budget_item_id,okved2_id,unit_id,payment_balance_item_id,is_not_russian_delivery,created_by,changed_by,currency_id,currency_rate,
    created_at, changed_at, is_removed
    )
    VALUES 
    ('00000000-0000-0000-0000-000000000001', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,0,0,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000002', '00000000-0000-0000-0000-000000000001',9000,'труба, железная,',9000,1,1,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000003', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,2,2,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000004', '00000000-0000-0000-0000-000000000001',11000,'труба, железная,',11000,3,3,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000005', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,4,4,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000006', '00000000-0000-0000-0000-000000000001',1000,'труба, железная,',1000,5,5,1,2,3,4,5,false,99,99,1,100,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000007', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,6,6,6,2,3,4,5,false,99,99,2,10,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000008', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,7,7,7,2,3,4,5,false,99,99,2,10,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000009', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,8,8,8,2,3,4,5,false,99,99,2,10,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000010', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,9,9,9,2,3,4,5,false,99,99,3,9,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000011', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,10,10,10,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000012', '00000000-0000-0000-0000-000000000002',1000,'пёс',1000,11,11,11,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000013', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,12,12,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000014', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,13,13,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000015', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,14,14,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000016', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,15,15,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false),
    ('00000000-0000-0000-0000-000000000017', '00000000-0000-0000-0000-000000000002',1000,'такса, железная,',1000,16,16,1,2,3,4,5,false,99,99,1,1,now()::date,now()::date, false);
