CREATE TABLE public.status_type
(
    id SMALLINT NOT NULL,
    name VARCHAR(100) NOT NULL DEFAULT '',
    object_type SMALLINT NOT NULL,
    status_type SMALLINT NOT NULL,
    is_removed BOOLEAN NOT NULL DEFAULT FALSE,
    created_at TIMESTAMP WITHOUT TIME ZONE NOT NULL,
    changed_at TIMESTAMP WITHOUT TIME ZONE NOT NULL,
    created_by INTEGER NOT NULL,
    changed_by INTEGER NOT NULL,
    CONSTRAINT tkp_status_type_pkey PRIMARY KEY (id)
);

COMMENT ON TABLE public.status_type IS 'Справочник "Типы статусов ТКП"';
COMMENT ON COLUMN public.status_type.id IS 'ID статуса';
COMMENT ON COLUMN public.status_type.object_type IS 'Тип объекта:
    1 - ЗЦИ
    2 - ТКП';
COMMENT ON COLUMN public.status_type.status_type IS 'Тип статуса ТКП:
    1 - Общий
    2 - Статус рассмотрения
    3 - Результат рассмотрения';
COMMENT ON COLUMN public.status_type.is_removed IS 'Признак удаления';

INSERT INTO public.status_type VALUES 
    (10, 'ТКП создано', 1, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (20, 'ТКП получено', 1, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (30, 'Не рассмотрено', 1, 2, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (40, 'Рассмотрено', 1, 2, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (50, 'Учитывать при АЦ', 1, 3, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (60, 'Не учитывать при АЦ', 1, 3, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (70, 'Проект ЗЦИ', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (80, 'Передан на ЭТП', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (90, 'Приём ТКП', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (100, 'Ошибка передачи на ЭТП', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (110, 'Приём ТКП закрыт ', 2, 1, false, '2025-03-06 15:38:34.985475', '2025-03-06 15:38:34.985475', 1, 1),
    (120, 'Приём ТКП закрыт досрочно', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (130, 'Рассмотрение завершено', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (140, 'ЗЦИ удалено', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (150, 'Ошибка публикации изменений', 2, 1, false, '2024-12-25 02:45:47.312', '2024-12-25 02:45:47.312', 444, 444),
    (160, 'ТКП удалено', 1, 1, false, '2025-03-06 15:38:34.985475', '2025-03-06 15:38:34.985475', 1, 1);
