INSERT INTO public.organizational_structure (uuid,id,text,text_short,"level",parent_id,"type",is_specialized_department,sap_id,is_removed,created_at,changed_at,created_by,changed_by) VALUES
	 ('f405ed12-da1c-40c6-911f-77d602117c73'::uuid,11,'Департамент 645','Д645',2,NULL,2,true,50001174,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658),
	 ('336bf013-4e0d-4121-9492-c124cefc7b21'::uuid,12,'Управление 645/4','У645/4',3,11,3,true,50001175,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658),
	 ('482337a1-dc2d-49b4-a340-5e0e6253237b'::uuid,13,'Отдел 645/4/3','О645/4/3',4,12,4,true,50001176,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658),
	 ('043bbe90-fc69-4afc-920f-3fe961a885ec'::uuid,21,'Служба корпоративной защиты ПАО ГП','СКЗ',2,NULL,2,true,50000576,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658),
	 ('e903d1d0-4a02-4f04-b0e1-d561d3b854b9'::uuid,22,'Управление комплексных систем безопасности','УКСБ',3,21,3,true,50000577,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658),
	 ('789757dd-734f-4de8-b40b-8326b89b9fe6'::uuid,23,'Информационный центр СКЗ','ИЦ СКЗ',3,21,3,true,50001950,false,'2024-02-05 14:16:53.072453','2024-02-05 14:16:53.072453',658,658);

INSERT INTO public.organizational_user_assignment (uuid,user_id,customer_id,department_id,position_id,organizer_id,purchasing_group_id) VALUES
	 ('a86044c5-7f5b-4eb7-8b38-45f35ae5ce3d'::uuid,666,0,21,0,0,0),
	 ('d48d8637-8fab-43f7-a64d-0047291d4419'::uuid,601,0,11,0,0,0),
	 ('e8e0469f-e4e2-4d67-9e23-4c839f1ec474'::uuid,602,0,12,0,0,0),
	 ('65b4ab6f-cd4b-4954-87b7-ebf74e4b184a'::uuid,603,0,12,0,0,0),
	 ('96780de8-398a-4ee6-9035-d86d62f59915'::uuid,604,0,13,0,0,0),
	 ('605d5bbf-a326-4bfb-948c-68de8cb1ef79'::uuid,605,0,13,0,0,0),
	 ('81235a50-da62-456d-a46f-15f4c9fe7760'::uuid,606,0,21,0,0,0),
	 ('fd346337-af89-4c98-9a78-5e9ea3902d57'::uuid,607,0,22,0,0,0),
	 ('6a2e5917-5c98-414a-a695-cc16ad7f9697'::uuid,608,0,22,0,0,0),
	 ('1861f216-23cf-4686-98d4-ced0bab8aa4d'::uuid,609,0,23,0,0,0),
	 ('2d418f0c-9743-4649-848b-875f5113a1f4'::uuid,658,0,12,0,0,0);
