INSERT INTO public.organizational_structure
(uuid, 									id,	text,								    	text_short,	"level",	parent_id,	"type",	is_specialized_department,	sap_id,	is_removed,	created_at,				changed_at,				created_by,changed_by) VALUES
('b998ee43-f549-4d9c-a55b-a0a1cfbe47e9'::uuid,    1,   'ПАО Газпром',								'ПАО ГП',      1,        NULL,      	1,		false,					50000002,	false,		'2024-02-05 14:16:53.072',	'2024-02-05 14:16:53.072',	 658,658),
('f405ed12-da1c-40c6-911f-77d602117c73'::uuid,	11,	'Департамент 645',							'Д645',		2,		1,		  	2,		true,					50001174,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('336bf013-4e0d-4121-9492-c124cefc7b21'::uuid,	12,	'Управление 645/4',							'У645/4',		3,		11,			3,		true,					50001175,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('482337a1-dc2d-49b4-a340-5e0e6253237b'::uuid,	13,	'Отдел 645/4/3',							'О645/4/3',	4,		12,			4,		true,					50001176,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('043bbe90-fc69-4afc-920f-3fe961a885ec'::uuid,	21,	'Служба корпоративной защиты ПАО ГП',		    	'СКЗ',		2,		1,		    	2,		true,					50000576,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('e903d1d0-4a02-4f04-b0e1-d561d3b854b9'::uuid,	22,	'Управление комплексных систем безопасности',   	'УКСБ',		3,		21,			3,		true,					50000577,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('789757dd-734f-4de8-b40b-8326b89b9fe6'::uuid,	23,	'Информационный центр СКЗ',				     'ИЦ СКЗ',		3,		21,			3,		true,					50001950,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('00000000-0000-0000-0000-000000000001'::uuid,	101,	'Непрофильный департамент',					'НД666',		2,		1,			2,		false,					60001950,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('00000000-0000-0000-0000-000000000002'::uuid,	102,	'Непрофильный отдел непрофильного департамента',	'НОНД777',	3,		101,			3,		false,					60001950,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658),
('00000000-0000-0000-0000-000000000003'::uuid,	103,	'Непрофильный подотдел непрофильного отдела',	'НПНОНД777',	4,		102,			4,		false,					60001950,	false,		'2024-02-05 14:16:53.072453',	'2024-02-05 14:16:53.072453',658,658);
